/**
 * От хозяина предприятие пришло новое условие требование.
 * На складе Warehouse не хватает место для хранения и поэтому
 * нужно добавить новый склад. Ваше решение?
 * Еще одно новое условие.
 * Появились продукты, которые можно переработать после исхода срока годности.
 * Нужно расширить программу.Что бы продукты в флагом canReproduct отправлялись на переработку.
 * Еще одно требование. Овощи пришедшие на обработку и попадающие на склад.
 * Должны храниться в специальном складе с низкой температурой. Ваши решения.
 * В данном задание надо сделать расширение кода за счет использование шаблона проектирование - декоратор
 * Помните. Вы не можете изменять код первого задания. Только расширять его.
 * Нельзя использовать instanceOf или if ("Shop".equals(storage.getName())).
 */
package ru.job4j.newFood;