/**
 * Создать модель User c полями name, login, email, createDate.
 *Необходимо создать сервлет UsersServlet и определить там методы do Get Post Put Delete.
 *Каждый метод сервлета должен выполнять только одно действие - создать пользователя, редактировать, получить. Удалить.
 *Для хранения данных использовать базу данных Postgresql. То есть при старте сервлета вам нужно создать коннект в базе данных и записывать туда данные.
 * DbConnect - модуль для соединения с бд.
 * MyHttpServlet - место хранения сервлета.
 * Main - для проверки работы с бд.
 *
 */
package ru.job4j.HTTP;